app/views/users/edit.html.erb

SELECT COUNT(*) FROM `vehicles` WHERE `vehicles`.`user_id` = 1
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1
---

<% if current_user.role.admin? && @user.vehicles.count > 0 %>