app/controllers/users_controller.rb

    def index
        # Only admin can see all users
        @user = current_user
        if @user.role.admin?
            @users = User.all
---
SELECT `users`.* FROM `users`

    def update
        @user = User.find(params[:id])

        if @user.update(user_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `users`.`first_name` = 'Test', `users`.`last_name` = 'Tester', `users`.`street_address` = 'Testing Street', `users`.`city` = 'Ottawa', `users`.`province` = 'Ontario', `users`.`postal_code` = 'K1T 2D2', `users`.`phone_number` = '1234567', `users`.`updated_at` = '2020-09-02 14:14:45.242975' WHERE `users`.`id` = 2

    def destroy
        @user = User.find(params[:id])

        if @user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1