app/controllers/vehicles_controller.rb

SELECT `vehicles`.* FROM `vehicles`
---
  def index
    @vehicles = Vehicle.all

INSERT INTO `vehicles` (`licence_plate`, `colour`, `make`, `model`, `year`, `created_at`, `updated_at`, `user_id`) VALUES ('K12Lagos', 'White', 'Toyota', '2', '2020', '2020-08-28 18:03:56.492795', '2020-08-28 18:03:56.492795', 3)
---
  def create
    @vehicle = Vehicle.new(vehicle_params)

    respond_to do |format|
      if @vehicle.save

UPDATE `vehicles` SET `vehicles`.`model` = '4', `vehicles`.`updated_at` = '2020-08-28 18:33:13.447217' WHERE `vehicles`.`id` = 1
---
  def update
    respond_to do |format|
      if @vehicle.update(vehicle_params)

DELETE FROM `vehicles` WHERE `vehicles`.`id` = 2
---
  def destroy
    @vehicle.destroy

SELECT `vehicles`.* FROM `vehicles` WHERE `vehicles`.`id` = 1 LIMIT 1
UPDATE `vehicles` SET `vehicles`.`status` = 1, `vehicles`.`updated_at` = '2020-08-28 18:44:53.817677' WHERE `vehicles`.`id` = 1
---
  def checkout
    @user = current_user
        @vehicle = Vehicle.find(params[:id])
        @vehicle.status = 1
        @vehicle.save

SELECT `vehicles`.* FROM `vehicles` WHERE `vehicles`.`id` = 1 LIMIT 1
---
    def set_vehicle
      @vehicle = Vehicle.find(params[:id])