app/views/vehicles/_user_vehicles.html.erb

SELECT `vehicles`.* FROM `vehicles` WHERE `vehicles`.`user_id` = 3
---
              <hr>
            <% @user.vehicles.each.with_index do |vehicle, index| %>

SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1
---

        <% unless current_user.role.admin? or @vehicles.length >= 2 %>