app/views/vehicles/index.html.erb


            <% unless current_user.role.admin? or @vehicles.length >= 2 %>
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1