app/views/vehicles/user_vehicles.html.erb

SELECT `vehicles`.* FROM `vehicles` WHERE `vehicles`.`user_id` = 2
---
              <hr>
            <% current_user.vehicles.each.with_index do |vehicle, index| %>

SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 2 LIMIT 1
---

        <% unless current_user.role.admin? or @vehicles.length >= 2 %>