app/models/user.rb

  def set_user_role
    user_role = Role.where(role_name: :user).first
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`role_name` = 1 ORDER BY `roles`.`id` ASC LIMIT 1

  def confirm_user
    self.confirmed_at = Date.today
    self.save!
---
UPDATE `users` SET `users`.`confirmed_at` = '2020-09-02 00:00:00', `users`.`updated_at` = '2020-09-02 14:30:51.300550' WHERE `users`.`id` = 2